In [1]:
#creating dataframe from dict

import numpy as np
import pandas as pd
y={'a':[1,2,3,4],'b':[3,4,5,6],'c':[4,8,5,6],'d':[9,7,5,2]}
pd.DataFrame(y,index=['one','two','three','four'])

       a  b  c  d
one    1  3  4  9
two    2  4  8  7
three  3  5  5  5
four   4  6  6  2

In [2]:
#pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
#pd.DataFrame(data,      row_index,  col_index,    dtype)

In [5]:
from numpy.random import rand as rd
df1=pd.DataFrame(rd(4,6),index=['a','b','c','d'],columns=['x','y','z','p','q','r'])
df1

          x         y         z         p         q         r
a  0.628683  0.936241  0.293607  0.892924  0.010230  0.594160
b  0.533621  0.440389  0.730081  0.554924  0.002806  0.629626
c  0.611285  0.146800  0.853594  0.149043  0.355627  0.761942
d  0.048341  0.957953  0.993687  0.013889  0.993617  0.734773

# Dealing with columns

In [6]:
#single col
df1['x']

a    0.628683
b    0.533621
c    0.611285
d    0.048341
Name: x, dtype: float64

In [7]:
#multiple col
df1[['x','z','r']]

          x         z         r
a  0.628683  0.293607  0.594160
b  0.533621  0.730081  0.629626
c  0.611285  0.853594  0.761942
d  0.048341  0.993687  0.734773

# adding a new col

In [8]:
df1['n']=df1['x'] + df1['z']
df1

          x         y         z         p         q         r         n
a  0.628683  0.936241  0.293607  0.892924  0.010230  0.594160  0.922289
b  0.533621  0.440389  0.730081  0.554924  0.002806  0.629626  1.263702
c  0.611285  0.146800  0.853594  0.149043  0.355627  0.761942  1.464879
d  0.048341  0.957953  0.993687  0.013889  0.993617  0.734773  1.042028

# dropping a col

In [9]:
#axis=0 represents row
#axis=1 represents col

df1.drop('q',axis=1)
df1

          x         y         z         p         q         r         n
a  0.628683  0.936241  0.293607  0.892924  0.010230  0.594160  0.922289
b  0.533621  0.440389  0.730081  0.554924  0.002806  0.629626  1.263702
c  0.611285  0.146800  0.853594  0.149043  0.355627  0.761942  1.464879
d  0.048341  0.957953  0.993687  0.013889  0.993617  0.734773  1.042028

In [11]:
#but its gonna remov the col temporarly
#to delete it permanently put inplace =True

df1.drop('q',axis=1,inplace=True)
df1

          x         y         z         p         r         n
a  0.628683  0.936241  0.293607  0.892924  0.594160  0.922289
b  0.533621  0.440389  0.730081  0.554924  0.629626  1.263702
c  0.611285  0.146800  0.853594  0.149043  0.761942  1.464879
d  0.048341  0.957953  0.993687  0.013889  0.734773  1.042028

# Dealing with rows

In [14]:
df1.loc['c']

x    0.611285
y    0.146800
z    0.853594
p    0.149043
r    0.761942
n    1.464879
Name: c, dtype: float64

In [13]:
df1.iloc[2]

x    0.611285
y    0.146800
z    0.853594
p    0.149043
r    0.761942
n    1.464879
Name: c, dtype: float64

# Adding a  new row

In [15]:
df1.loc['e']=df1.loc['a']+df1.loc['b']
df1

          x         y         z         p         r         n
a  0.628683  0.936241  0.293607  0.892924  0.594160  0.922289
b  0.533621  0.440389  0.730081  0.554924  0.629626  1.263702
c  0.611285  0.146800  0.853594  0.149043  0.761942  1.464879
d  0.048341  0.957953  0.993687  0.013889  0.734773  1.042028
e  1.162304  1.376630  1.023688  1.447849  1.223786  2.185992

# dropping a row

In [16]:
df1.drop('b',axis=0,inplace=True)
df1

          x         y         z         p         r         n
a  0.628683  0.936241  0.293607  0.892924  0.594160  0.922289
c  0.611285  0.146800  0.853594  0.149043  0.761942  1.464879
d  0.048341  0.957953  0.993687  0.013889  0.734773  1.042028
e  1.162304  1.376630  1.023688  1.447849  1.223786  2.185992

# row nd col simul

In [18]:
df1.loc['a','y'] #single element

0.9362409871266822

In [20]:
df1.loc[['a','d','e'],['z','r','n']] #multiple elements

          z         r         n
a  0.293607  0.594160  0.922289
d  0.993687  0.734773  1.042028
e  1.023688  1.223786  2.185992

# Boolean DataFrame

In [21]:
df1[df1>0.6]

          x         y         z         p         r         n
a  0.628683  0.936241       NaN  0.892924       NaN  0.922289
c  0.611285       NaN  0.853594       NaN  0.761942  1.464879
d       NaN  0.957953  0.993687       NaN  0.734773  1.042028
e  1.162304  1.376630  1.023688  1.447849  1.223786  2.185992

In [22]:
df1[df1['z']>0.5]

          x         y         z         p         r         n
c  0.611285  0.146800  0.853594  0.149043  0.761942  1.464879
d  0.048341  0.957953  0.993687  0.013889  0.734773  1.042028
e  1.162304  1.376630  1.023688  1.447849  1.223786  2.185992

In [23]:
df1[(df1['y']>0.94) & (df1['z']>1)]

          x        y         z         p         r         n
e  1.162304  1.37663  1.023688  1.447849  1.223786  2.185992

In [30]:
df1[(df1['n']>1) | (df1['z']>1)]

          x         y         z         p         r         n
c  0.611285  0.146800  0.853594  0.149043  0.761942  1.464879
d  0.048341  0.957953  0.993687  0.013889  0.734773  1.042028
e  1.162304  1.376630  1.023688  1.447849  1.223786  2.185992

# Group By

In [31]:
data={'Company':['Goog','Goog','MSFT','MSFT','FB','FB'],
     'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350]}
a=pd.DataFrame(data)
a

  Company   Person  Sales
0    Goog      Sam    200
1    Goog  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [34]:
g_obj=a.groupby('Company') #with this we will get a grp by obj
g_obj.mean()               #next step is to apply aggregation func

         Sales
Company
FB       296.5
Goog     160.0
MSFT     232.0

In [39]:
g_obj.std()

              Sales
Company
FB        75.660426
Goog      56.568542
MSFT     152.735065

In [35]:
g_obj.sum()

         Sales
Company
FB         593
Goog       320
MSFT       464

In [36]:
g_obj.max()

          Person  Sales
Company
FB         Sarah    350
Goog         Sam    200
MSFT     Vanessa    340

In [37]:
g_obj.min()

          Person  Sales
Company
FB          Carl    243
Goog     Charlie    120
MSFT         Amy    124

In [38]:
g_obj.count()

         Person  Sales
Company
FB            2      2
Goog          2      2
MSFT          2      2

In [45]:
g_obj.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [48]:
a.groupby('Company').sum().loc['Goog']

Sales    320
Name: Goog, dtype: int64